; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v9 ?v11)
             (pred_2 ?v3 ?v13)
             (pred_3 ?v9 ?v13)
             (pred_9 ?v4 ?v9 )
	     (pred_11 ?v9)
             (pred_4 ?v2)
             (pred_6 ?v3)
             (pred_1 ?v13)
             (pred_12 ?v9)
             (pred_8 ?v3)
             (pred_10 ?v9)
             (pred_5 ))



(:action op_4
:parameters (?v6 ?v12 ?v7 ?v8)
:precondition (and (pred_4 ?v6) (pred_4 ?v12) (pred_6 ?v7) (pred_1 ?v8)
          (pred_7 ?v6 ?v12) (pred_2 ?v7 ?v8)
                   (pred_3 ?v12 ?v8) (pred_11 ?v6) 
                   (pred_12 ?v12) (pred_8 ?v7))
:effect (and  (pred_10 ?v12) (not (pred_12 ?v12))))


(:action op_2
:parameters (?v6 ?v10)
:precondition (and (pred_4 ?v6) (pred_4 ?v10)
               (pred_11 ?v6) (pred_7 ?v6 ?v10) (pred_10 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v6))))

(:action op_3
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_6 ?v7) 
                  (pred_11 ?v6) (pred_9 ?v7 ?v6) (pred_5 ))
:effect (and (pred_8 ?v7)
   (not (pred_9 ?v7 ?v6)) (not (pred_5 ))))


(:action op_5
:parameters (?v6 ?v1 ?v5)
:precondition (and (pred_4 ?v6) (pred_6 ?v1) (pred_6 ?v5)
                  (pred_11 ?v6) (pred_8 ?v5) (pred_9 ?v1 ?v6))
:effect (and (pred_8 ?v1) (pred_9 ?v5 ?v6)
        (not (pred_8 ?v5)) (not (pred_9 ?v1 ?v6))))

(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_6 ?v7) 
                  (pred_11 ?v6) (pred_8 ?v7))
:effect (and (pred_5 ) (pred_9 ?v7 ?v6) (not (pred_8 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_23 obj_06 obj_30 obj_29 obj_25 obj_03 obj_10 obj_12 obj_13 obj_28 obj_11 obj_26 obj_22 obj_14 obj_08 obj_32 obj_20 obj_01 obj_15 obj_21 obj_31 obj_24 obj_27 obj_07 obj_04
    obj_05 obj_17 obj_19
    obj_02 obj_09 obj_16 obj_18
    )

    (:init
       (pred_5)

       (pred_4 obj_23)
       (pred_4 obj_06)
       (pred_4 obj_30)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_12)
       (pred_4 obj_13)
       (pred_4 obj_28)
       (pred_4 obj_11)
       (pred_4 obj_26)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_32)
       (pred_4 obj_20)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_31)
       (pred_4 obj_24)
       (pred_4 obj_27)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_1 obj_05)
       (pred_1 obj_17)
       (pred_1 obj_19)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_18)

       (pred_7 obj_23 obj_03)
       (pred_7 obj_23 obj_06)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_30)
       (pred_7 obj_06 obj_23)
       (pred_7 obj_30 obj_12)
       (pred_7 obj_30 obj_29)
       (pred_7 obj_30 obj_06)
       (pred_7 obj_29 obj_13)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_29 obj_30)
       (pred_7 obj_25 obj_28)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_23)
       (pred_7 obj_10 obj_26)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_12 obj_22)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_12 obj_30)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_13 obj_14)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_13 obj_29)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_28 obj_08)
       (pred_7 obj_28 obj_25)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_11 obj_32)
       (pred_7 obj_11 obj_26)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_26 obj_20)
       (pred_7 obj_26 obj_22)
       (pred_7 obj_26 obj_10)
       (pred_7 obj_26 obj_11)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_22 obj_12)
       (pred_7 obj_22 obj_26)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_28)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_32 obj_31)
       (pred_7 obj_32 obj_20)
       (pred_7 obj_32 obj_11)
       (pred_7 obj_20 obj_24)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_20 obj_26)
       (pred_7 obj_20 obj_32)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_31 obj_24)
       (pred_7 obj_31 obj_32)
       (pred_7 obj_24 obj_27)
       (pred_7 obj_24 obj_20)
       (pred_7 obj_24 obj_31)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_24)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_07)
       (pred_12 obj_28)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_3  obj_28 obj_05)
       (pred_3  obj_01 obj_17)
       (pred_3  obj_29 obj_19)
       (pred_3  obj_25 obj_05)
       (pred_10 obj_23)
       (pred_10 obj_06)
       (pred_10 obj_30)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_26)
       (pred_10 obj_22)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_10 obj_32)
       (pred_10 obj_20)
       (pred_10 obj_15)
       (pred_10 obj_21)
       (pred_10 obj_31)
       (pred_10 obj_24)
       (pred_10 obj_27)
       (pred_10 obj_07)
       (pred_10 obj_04)

       (pred_2  obj_02 obj_05)
       (pred_2  obj_09 obj_17)
       (pred_2  obj_16 obj_19)
       (pred_2  obj_18 obj_19)
       (pred_9 obj_02 obj_27)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_18 obj_21)
       (pred_11 obj_12)
    )

    (:goal (and
       (pred_9 obj_09 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_14)))
)
)

; plan
1. (op_2 obj_12 obj_22)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_22)
   goals met: 0 of 1
2. (op_2 obj_22 obj_26)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_26)
   goals met: 0 of 1
3. (op_2 obj_26 obj_20)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_20)
   goals met: 0 of 1
4. (op_2 obj_20 obj_24)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_24)
   goals met: 0 of 1
5. (op_2 obj_24 obj_27)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_27)
   goals met: 0 of 1
6. (op_2 obj_27 obj_07)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_07)
   goals met: 0 of 1
7. (op_2 obj_07 obj_04)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_04)
   goals met: 0 of 1
8. (op_3 obj_04 obj_09)
   deleted: (pred_9 obj_09 obj_04) (pred_5)
   added: (pred_8 obj_09)
   goals met: 0 of 1
9. (op_2 obj_04 obj_21)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_21)
   goals met: 0 of 1
10. (op_2 obj_21 obj_15)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_15)
   goals met: 0 of 1
11. (op_4 obj_15 obj_01 obj_09 obj_17)
   deleted: (pred_12 obj_01)
   added: (pred_10 obj_01)
   goals met: 0 of 1
12. (op_2 obj_15 obj_01)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_01)
   goals met: 0 of 1
13. (op_2 obj_01 obj_22)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_22)
   goals met: 0 of 1
14. (op_2 obj_22 obj_12)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_12)
   goals met: 0 of 1
15. (op_1 obj_12 obj_09)
   deleted: (pred_8 obj_09)
   added: (pred_5) (pred_9 obj_09 obj_12)
   goals met: 1 of 1
